Revit 2027 API
IConnector.CoordinateSystem Property
The coordinate system of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
Transform CoordinateSystem { get; }
ReadOnly Property CoordinateSystem As Transform
	Get
property Transform^ CoordinateSystem {
	Transform^ get ();
}
abstract CoordinateSystem : Transform with get
Property Value
Transform
Remarks
The Z axis of the coordinate system is the normal to the plane of the connector.
See Also
Reference
IConnector Interface
Autodesk.Revit.DB Namespace